{
  "name": "",
  "type": "directory",
  "children": [
    {
      "name": "over-mij",
      "type": "directory",
      "children": [
        {
          "name": "over-mij",
          "type": "md",
          "content": "Hoi!! Ik ben een software developer gespecialiseerd in webdevelopment. Ik heb echt een passie voor het bouwen van coole, interactieve en gebruiksvriendelijke webapplicaties.\nVan front-end tot back-end: ik vind het geweldig om ideeën om te zetten in iets dat werkt en er goed uitziet. Ik blijf mezelf verbeteren en leren over nieuwe tools, technologieën en best practices binnen het vakgebied."
        },
        {
          "name": "contact",
          "type": "md",
          "content": "Mobile: +31687627550\nEmail: alexanderwu271206@gmail.com"
        },
        {
          "name": "foto",
          "type": "png",
          "content": "assets/images/profile.jpg"
        },
        {
          "name": "technologieën",
          "type": "md",
          "content": "# Technologieën die ik gebruik\n\nJavaScript\nTypescript\nNode.js\nPython\nC#\nGodot\nAngular\nNuxt\nExpress"
        }
      ]
    },
    {
      "name": "werkprocessen",
      "type": "directory",
      "children": [
        {
          "name": "k1",
          "type": "directory",
          "children": [
            {
              "name": "w1",
              "type": "directory",
              "children": [
                {
                  "name": "quiz-app",
                  "type": "directory",
                  "children": [
                    {
                      "name": "quiz-app",
                      "type": "shortcut",
                      "content": "/projecten/quiz-app/documentatie"
                    },
                    {
                      "name": "quiz-app",
                      "type": "md",
                      "content": "# Planning van de quiz-app\n## B1-K1-W1: Plant werkzaamheden en bewaakt de voortgang\nDeze competentie wordt beschreven en aangetoond in de volgende twee bestanden:\n- behoefteanalyse\n- functioneel-ontwerp"
                    }
                  ]
                }
              ]
            },
            {
              "name": "w2",
              "type": "directory",
              "children": [
                {
                  "name": "quiz-app",
                  "type": "directory",
                  "children": [
                    {
                      "name": "quiz-app",
                      "type": "shortcut",
                      "content": "/projecten/quiz-app/documentatie"
                    },
                    {
                      "name": "quiz-app",
                      "type": "md",
                      "content": "# Ontwerpen van de quiz-app\n## B1-K1-W2: Ontwerpt software\nDeze competentie wordt beschreven en aangetoond in het volgende bestand:\n- technisch-ontwerp"
                    }
                  ]
                }
              ]
            },
            {
              "name": "w3",
              "type": "directory",
              "children": []
            },
            {
              "name": "w4",
              "type": "directory",
              "children": []
            },
            {
              "name": "w5",
              "type": "directory",
              "children": []
            }
          ]
        },
        {
          "name": "k2",
          "type": "directory",
          "children": [
            {
              "name": "w1",
              "type": "directory",
              "children": []
            },
            {
              "name": "w2",
              "type": "directory",
              "children": []
            },
            {
              "name": "w3",
              "type": "directory",
              "children": [
                {
                  "name": "quiz-app",
                  "type": "directory",
                  "children": [
                    {
                      "name": "verslag",
                      "type": "md",
                      "content": "# Reflectie ontwikkeling quiz-app - HBO-keuzedeel\n\n**Situatie**\nVoor het keuzedeelproject heb ik een interactieve quiz-app ontwikkeld met real-time functionaliteit. Het doel was om een systeem te bouwen waarmee meerdere gebruikers tegelijk een quiz kunnen spelen, met live scores, feedback en gebruiksvriendelijke bediening. De applicatie moest volledig werken in een full-stack omgeving.\n\n**Taak**\nMijn taak was om zelfstandig een werkende quiz-app op te zetten, inclusief front-end, back-end, database, real-time communicatie, beveiliging en testscenario's. Alles moest in de cloud kunnen draaien en het project moest voldoen aan eisen rond UX, schaalbaarheid en technische degelijkheid.\n\n**Actie**\nIk koos voor Angular en Bootstrap voor de front-end, Express.js en Socket.IO voor de back-end en MongoDB als database. Tijdens de eerste weken had ik vrij weinig aan het project gewerkt. Hierdoor zijn we eigenlijk pas vanaf week 4 echt goed begonnen met ontwikkelen, wat vrij laat was gezien de totale looptijd van 10 weken. Dat zorgde ervoor dat we in de laatste weken flink moesten doorwerken om alles af te krijgen. Ondanks die tijdsdruk is het gelukt om de applicatie technisch goed af te ronden. \n\nDaarnaast heb ik duidelijke use cases en diagrammen gemaakt en meerdere scenario's getest (goede/foute antwoorden, scoreberekening, eindresultaat). Wel merkte ik dat de communicatie binnen ons groepje niet altijd soepel verliep. We overlegden soms te weinig of niet op tijd, wat tot verwarring kon leiden. Ook stelde ik niet altijd meteen vragen als iets onduidelijk was, waardoor er later extra werk ontstond. Inputvalidatie, vergrendelde rooms en beveiligde serverroutes zijn gelukkig wel netjes geïmplementeerd.\n\n**Resultaat**\nDe applicatie draait stabiel in de lokale & cloud omgeving en voldoet functioneel aan de eisen. Gebruikers kunnen quizzen aanmaken, deelnemen via een toegangscode of rooms aan te klikken als deze niet privé zijn en in real-time feedback ontvangen dankzij socket.IO. Scores en antwoorden worden correct verwerkt. De Azure-hosting is nog niet volledig af, mede omdat ik door de focus op development weinig tijd overhield om dit goed op te zetten. Uiteindelijk heb ik het wel werkend gekregen. Het probleem lag bij hoe de applicatie niet een exposed port had door de verkeerde methode van deployen. Ookal was deployen succesvol was het krap qua deadline. De code is geschreven in TypeScript en goed gestructureerd voor onderhoudbaarheid.\n\n**Reflectie**\nIk heb veel geleerd over het zelfstandig bouwen van een full-stack applicatie, en vooral over hoe belangrijk het is om je tijd goed in te delen. Te laat beginnen met de daadwerkelijke development zorgde voor stress richting het einde. Ook heb ik geleerd dat ik eerder hulp moet vragen als iets niet duidelijk is, en dat heldere communicatie met teamleden essentieel is om misverstanden en vertraging te voorkomen. Mijn technische skills zijn gegroeid, zeker n Socket.IO, maar in een volgend project wil ik meer aandacht geven aan planning, afstemming en documentatie."
                    },
                    {
                      "name": "README",
                      "type": "md",
                      "content": "# README - Reflectie quiz-app\n\nDit bestand bevat een reflectie over de ontwikkeling van een interactieve quiz-app.\nVoor de reflectie heb ik gebruik gemaakt van de STARR-methode: Situatie, Taak, Actie, Resultaat en Reflectie."
                    }
                  ]
                },
                {
                  "name": "stimuliz-profielpagina",
                  "type": "directory",
                  "children": [
                    {
                      "name": "verslag",
                      "type": "md",
                      "content": "# Reflectie op profielpagina ontwikkeling - Stimuliz\n\n**Situatie**\nTijdens de ontwikkeling van de profielpagina voor Stimuliz was het doel om een pagina te maken waar gebruikers hun persoonsgegevens kunnen beheren. In de eerste versie werd gewerkt met een 'Aanpassen'-knop en een modal om wijzigingen door te voeren.\n\n**Taak**\nMijn taak was om ervoor te zorgen dat de profielpagina alle user stories ondersteunt: persoonsgegevens wijzigen, e-mail aanpassen, wachtwoord wijzigen, 2FA-methodes beheren en accountrollen bekijken. Daarnaast moest de gebruikerservaring zo eenvoudig mogelijk zijn.\n\n**Actie**\nIn eerste instantie bouwde ik de functionaliteit met een aparte knop en modal voor bewerkingen. Na feedback van Danny, die aangaf dat dit omslachtig was, heb ik de pagina aangepast naar inline bewerken. Hierdoor worden velden direct bewerkbaar zonder extra stappen. Dit zorgde voor minder code en een vloeiendere UX.\n\n**Resultaat**\nDe aangepaste versie ondersteunt alle user stories, valideert correct en is gebruiksvriendelijker geworden. De inline bewerking maakt het eenvoudiger voor gebruikers om gegevens aan te passen en zorgt voor minder complexe code. Danny gaf aan dat deze aanpak de voorkeur heeft vanwege de betere UX en kortere gebruikersflow.\n\n**Reflectie**\nDoor goed te luisteren naar feedback en hier snel op te reageren, heb ik de gebruikerservaring verbeterd én de code vereenvoudigd. Ik heb actief gereflecteerd op mijn keuzes en ingezien hoe belangrijk het is om flexibel te zijn in het ontwikkelproces. Dit heeft niet alleen mijn technische werk verbeterd, maar ook mijn samenwerking binnen het team versterkt."
                    },
                    {
                      "name": "README",
                      "type": "md",
                      "content": "# README - Reflectie Stimuliz - Profielpagina\n\nDit bestand bevat een reflectie over het aanpassen van de profielpagina binnen het Stimuliz-project.\nVoor de reflectie heb ik gebruik gemaakt van de STARR-methode: Situatie, Taak, Actie, Resultaat en Reflectie."
                    },
                    {
                      "name": "profielpagina-oud",
                      "type": "directory",
                      "children": [
                        {
                          "name": "profielpagina-oud-1",
                          "type": "png",
                          "content": "/assets/stimuliz/profile/reflection/profile-old-1.png"
                        },
                        {
                          "name": "profielpagina-oud-2",
                          "type": "png",
                          "content": "/assets/stimuliz/profile/reflection/profile-old-2.png"
                        },
                        {
                          "name": "profielpagina-oud-3",
                          "type": "png",
                          "content": "/assets/stimuliz/profile/reflection/profile-old-3.png"
                        },
                        {
                          "name": "profielpagina-oud-4",
                          "type": "png",
                          "content": "/assets/stimuliz/profile/reflection/profile-old-4.png"
                        }
                      ]
                    },
                    {
                      "name": "profielpagina-nieuw",
                      "type": "directory",
                      "children": [
                        {
                          "name": "profielpagina-nieuw-1",
                          "type": "png",
                          "content": "/assets/stimuliz/profile/reflection/profile-new-1.png"
                        },
                        {
                          "name": "profielpagina-nieuw-2",
                          "type": "png",
                          "content": "/assets/stimuliz/profile/reflection/profile-new-2.png"
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "projecten",
      "type": "directory",
      "children": [
        {
          "name": "quiz-app",
          "type": "directory",
          "children": [
            {
              "name": "README",
              "type": "md",
              "content": "# Quiz-app - HBO keuzedeel\n\nVoor deze challenge was de opdracht om een interactieve multiplayer quiz te maken voor de open dag van Zuyd Hogeschool. Ik had ervoor gekozen om deze uitdaging aan te pakken door een eigen remake van Kahoot te bouwen."
            },
            {
              "name": "technologieën",
              "type": "md",
              "content": "# Gebruikte technologieën\n\nAngular\nExpressJS\nBootstrap\nMongoDB\nSocketIO\nTypescript"
            },
            {
              "name": "opdracht",
              "type": "url",
              "content": "assets/quiz-app/opdracht.pdf"
            },
            {
              "name": "repository",
              "type": "url",
              "content": "https://github.com/Sephtonlol/HboKeuzedeel"
            },
            {
              "name": "documentatie",
              "type": "directory",
              "children": [
                {
                  "name": "functioneel-ontwerp",
                  "type": "url",
                  "content": "assets/quiz-app/functioneel-ontwerp.pdf"
                },
                {
                  "name": "behoefteanalyse",
                  "type": "url",
                  "content": "assets/quiz-app/behoefteanalyse.pdf"
                },
                {
                  "name": "technisch-ontwerp",
                  "type": "url",
                  "content": "assets/quiz-app/technisch-ontwerp.pdf"
                }
              ]
            }
          ]
        },
        {
          "name": "kunst-theater-media",
          "type": "directory",
          "children": [
            {
              "name": "frontend",
              "type": "directory",
              "children": []
            },
            {
              "name": "backend",
              "type": "directory",
              "children": []
            },
            {
              "name": "cms",
              "type": "directory",
              "children": []
            }
          ]
        },
        {
          "name": "stimuliz-v2",
          "type": "directory",
          "children": [
            {
              "name": "README",
              "type": "md",
              "content": "# Stimuliz-v2\nStimuliz is een platform uit Heerlen dat motorische ontwikkeling van kinderen meet en inzicht geeft aan scholen en sportorganisaties. Het is een onderdeel van Hellosunshine.\n\nVoor mijn stage help ik mee om de frontend van Stimuliz volledig opnieuw te bouwen met Nuxt 3, de nieuwste versie van het framework."
            },
            {
              "name": "technologieën",
              "type": "md",
              "content": "# Gebruikte technologieën\n\nNuxt\nDocker\nTailwind"
            },
            {
              "name": "profielpagina",
              "type": "directory",
              "children": [
                {
                  "name": "README",
                  "type": "md",
                  "content": "# Feature: Profielbeheer\nDeze feature stelt ingelogde gebruikers in staat om hun profiel te beheren. Gebruikers kunnen hun persoonlijke gegevens en voorkeuren aanpassen, zodat hun account actueel en veilig blijft.\n\nBelangrijkste mogelijkheden:\n- Persoonsgegevens en e-mailadres wijzigen\n- Wachtwoord aanpassen\n- Inzicht in gekoppelde accounts en rollen\n- Inzien en aanpassen van de actieve 2FA-methode\n- Verwijderen van 2FA via sms\n- Aanpassen van specifieke accountinstellingen\n\nOpmerkingen:\n- De bestaande URL-structuur blijft gehandhaafd\n- Formulieren bevatten relevante validaties\n- Styling volgt de huidige layout; geen extra opmaak nodig\nDeze feature bestaat uit meerdere subtaken, waaronder het wijzigen van gegevens, wachtwoord, 2FA-methodes, accounts en instellingen."
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}
